of_seminar_Sloshing/sloshingTank/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh	dynamicMotionSolverFvMesh;
motionSolverLibs ( "libfvMotionSolvers.so" );
motionSolver		solidBody;

solidBodyMotionFunction	oscillatingLinearMotion;


oscillatingLinearMotionCoeffs
{
		amplitude	(0 0.004 0);  //****Set proper motion amplitude****
		omega		7.1484;		//***Set proper motion omega****
}

// ************************************************************************ //
